tutorials/fluids/immersedBoundary/heartValveInDuct/system/refineMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      refineMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Refinement of the cell set written by immersedBodyRefinementCells, in the
// three directions
set             refineCells;

coordinateSystem global;

globalCoeffs
{
    tan1        (1 0 0);
    tan2        (0 1 0);
}

directions      (tan1 tan2 normal);

useHexTopology  yes;

geometricCut    no;

writeMesh       no;

// ************************************************************************* //
