tutorials/fluids/immersedBoundary/heartValveInDuct/Allrun
#!/bin/bash
cd "${0%/*}" || exit  # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Source solids4Foam scripts
source solids4FoamScripts.sh

# The immersed boundary library is only built with OpenFOAM.com
solids4Foam::caseDoesNotRunWithFoamExtend
solids4Foam::caseDoesNotRunWithOpenFOAMOrg

# Create the mesh; the mesh density is set by MESH_LEVEL (default 1)
solids4Foam::runApplication blockMesh

# Optionally refine the mesh REFINE_LEVELS times (default 0) around the region
# swept by the valve over the first cycle, halving the width of the band at
# each level: the immersed boundary method needs about three cells or more
# across the thickness of the leaflets
REFINE_LEVELS=${REFINE_LEVELS:-0}
distance=0.002
for level in $(seq 1 "$REFINE_LEVELS")
do
    solids4Foam::runApplication -s "$level" immersedBodyRefinementCells \
        -bodies "(valve)" -distance "$distance" -startTime 0 -endTime 0.8
    solids4Foam::runApplication -s "$level" refineMesh -overwrite
    distance=$(awk "BEGIN {print 0.5*$distance}")
done

# Run the solver; the valve motion is set by VALVE_MOTION (sliceAxis, the
# default, or morph)
solids4Foam::runApplication solids4Foam

# Plot the flow rate
if command -v gnuplot &> /dev/null
then
    echo "Generating flowRate.pdf using gnuplot"
    gnuplot flowRate.gnuplot &> /dev/null
else
    echo "Please install gnuplot if you would like to generate the plots"
fi
